---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.ApplicationException
source: html/c124c5ec-3773-778f-f52c-bfe1251d41d4.htm
---
# ApplicationException Members

Retrieves data needed to serialize the target object.